SpenceKonde/DxCore/megaavr/variants/64pin-standard/pins_arduino.h
/* Use this for accessing PINnCTRL register */
const uint8_t digital_pin_to_bit_mask[] = {
  PIN0_bm,  //  0 PA0
  PIN1_bm,  //  1 PA1
  PIN2_bm,  //  2 PA2
  PIN3_bm,  //  3 PA3
  PIN4_bm,  //  4 PA4
  PIN5_bm,  //  5 PA5
  PIN6_bm,  //  6 PA6
  PIN7_bm,  //  7 PA7
  PIN0_bm,  //  8 PB0
  PIN1_bm,  //  9 PB1
  PIN2_bm,  //  10 PB2
  PIN3_bm,  //  11 PB3
  PIN4_bm,  //  12 PB4
  PIN5_bm,  //  13 PB5
  PIN6_bm,  //  14 PB6
  PIN7_bm,  //  15 PB7
  PIN0_bm,  //  16 PC0
  PIN1_bm,  //  17 PC1
  PIN2_bm,  //  18 PC2
  PIN3_bm,  //  19 PC3
  PIN4_bm,  //  20 PC4
  PIN5_bm,  //  21 PC5
  PIN6_bm,  //  22 PC6
  PIN7_bm,  //  23 PC7
  PIN0_bm,  //  24 PD0
  PIN1_bm,  //  25 PD1
  PIN2_bm,  //  26 PD2
  PIN3_bm,  //  27 PD3
  PIN4_bm,  //  28 PD4
  PIN5_bm,  //  29 PD5
  PIN6_bm,  //  30 PD6
  PIN7_bm,  //  31 PD7
  PIN0_bm,  //  32 PE0
  PIN1_bm,  //  33 PE1
  PIN2_bm,  //  34 PE2
  PIN3_bm,  //  35 PE3
  PIN4_bm,  //  36 PE4
  PIN5_bm,  //  37 PE5
  PIN6_bm,  //  38 PE6
  PIN7_bm,  //  39 PE7
  PIN0_bm,  //  40 PF0
  PIN1_bm,  //  41 PF1
  PIN2_bm,  //  42 PF2
  PIN3_bm,  //  43 PF3
  PIN4_bm,  //  44 PF4
  PIN5_bm,  //  45 PF5
  PIN0_bm,  //  46 PG0
  PIN1_bm,  //  47 PG1
  PIN2_bm,  //  48 PG2
  PIN3_bm,  //  49 PG3
  PIN4_bm,  //  50 PG4
  PIN5_bm,  //  51 PG5
  PIN6_bm,  //  52 PG6
  PIN7_bm,  //  53 PG7
  PIN6_bm,  //  54 PF6
};

const uint8_t digital_pin_to_timer[] = {
  NOT_ON_TIMER, //  0
  NOT_ON_TIMER, //  1
  NOT_ON_TIMER, //  2
  NOT_ON_TIMER, //  3
  NOT_ON_TIMER, //  4 PA4/MOSI
  NOT_ON_TIMER, //  5 PA5/MISO
  TIMERD0,      //  6 PA6/SCK
  TIMERD0,      //  7 PA7/SS/CLKOUT
  TIMERA1,      //  8 PB0
  TIMERA1,      //  9 PB1
  TIMERA1,      //  10 PB2
  TIMERA1,      //  11 PB3
  TIMERA1,      //  12 PB4
  TIMERA1,      //  13 PB5
  NOT_ON_TIMER, //  14
  NOT_ON_TIMER, //  15
  TIMERA0,      //  16 PC0
  TIMERA0,      //  17 PC1
  TIMERA0,      //  18 PC2
  TIMERA0,      //  19 PC3
  TIMERA0,      //  20 PC4
  TIMERA0,      //  21 PC5
  NOT_ON_TIMER, //  22 PC6
  NOT_ON_TIMER, //  23 PC7
  NOT_ON_TIMER, //  24 PD0
  NOT_ON_TIMER, //  25
  NOT_ON_TIMER, //  26
  NOT_ON_TIMER, //  27
  NOT_ON_TIMER, //  28
  NOT_ON_TIMER, //  29
  DACOUT,       //  30 PD6
  NOT_ON_TIMER, //  31 PD7
  NOT_ON_TIMER, //  32 PE0
  NOT_ON_TIMER, //  33
  NOT_ON_TIMER, //  34
  NOT_ON_TIMER, //  35
  NOT_ON_TIMER, //  36
  NOT_ON_TIMER, //  37
  NOT_ON_TIMER, //  38
  NOT_ON_TIMER, //  39
  NOT_ON_TIMER, //  40 PF0 (TOSC1)
  NOT_ON_TIMER, //  41 PF1 (TOSC2)
  NOT_ON_TIMER, //  42
  NOT_ON_TIMER, //  43
  TIMERB0,      //  44 PF4
  TIMERB1,      //  45 PF5
  NOT_ON_TIMER, //  46 PF6 (RESET)
  NOT_ON_TIMER, //  47 PG0
  NOT_ON_TIMER, //  48
  TIMERB4,      //  49
  NOT_ON_TIMER, //  50
  NOT_ON_TIMER, //  51
  NOT_ON_TIMER, //  52
  NOT_ON_TIMER, //  53
  NOT_ON_TIMER, //  54 PG7
};


#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.

#define SERIAL_PORT_MONITOR       Serial
#define SERIAL_PORT_HARDWARE      Serial1
#define SERIAL_PORT_HARDWARE_OPEN Serial2

// Spence Konde: Okay, I think this is pretty stupid, but it's also harmless, which is
// better than many of the stupid things that are now part of the "API" - since I can
// support this without kneecapping the core, why not?
// A library that needs to use serial ports for something should *really* demand
// the user pass the desired serial port to use to the constructor or equivalent.
//
// Serial (USART0) as the Serial Monitor serial port.
// Serial2 (USART2) as the "hardware" serial port (I mean, Serial also is... but it
// is the one most likely also connected to a serial monitor.
// Serial1 (USART1) as the "open hardware" serial port on the grounds that it's not the
// serial monitor port, and the only pins for USART2 are also the only pins available
// for a watch crystal for autotuning and keeping time while sleeping on the 28-pin
// parts.
//
// Kept the same parts across larger pincounts for consistency, though I'd be easy
// to convince that this was a bad idea.
//
// If having definitions here ends up making anything worse than it otherwise would
// be, please report it in the issues. My sense is that if a library uses these
// it would either be unusable without them, or it offers the user a way to pass
// in a serial port, and if they don't like these, passing one in would override it.
//
// Note: On DB-series parts, Serial1 is the MVIO serial port; there's no define
// here for that, of course. Which will get a bit awkward, as I think about it,
// because on the DD-series parts, if they've got 14 or 20 pins, Serial/USART0
// on an alternate pin mapping will be the MVIO serial port - they don't have PC0
// so Serial1 on default mapping doesn't have it's TX pin, but there's a USART0
// mapping with TX/RX on PC1/PC2. So a SERIAL_PORT_MVIO define *would* be handy!

#endif
